// © Copyright 2010, 2015-2016 HP Development Company, L.P.

TaskName = "Escanear a ordenador";

// Restore alert message
"RESTORE_TITLE" = "¿Seguro que desea restablecer los ajustes?";
"RESTORE_MSG" = "Si continúa, se restablecerán todos los accesos directos a sus valores originales. Pulse Cancelar para dejar los accesos directos sin modificar o Restablecer para recuperar los valores predeterminados de fábrica.";
"RESTORE_BUTTON_TITLE" = "Restablecer";

"DEFAULT_TASK_CAPTION" = "Nombre de tarea:";
"DONE" = "Terminado";

// Task not found alert message
"TASK_NOT_FOUND_TITLE" = "Tarea no disponible";
"TASK_NOT_FOUND_DESC" = "La tarea “%@” detectada en el dispositivo no está disponible en el sistema. Seleccione otra tarea.";

// Copy workflows fail alert message
"COPY_WORKFLOWS_TITLE" = "Error de copia de flujo de trabajo";
"COPY_WORKFLOWS_DESC" = "No se pueden copiar los flujos de trabajo en la carpeta de dominio del dispositivo de usuario";

"DEVICE_NOT_FOUND_TITLE" = "No se encuentra el dispositivo.";
"DEVICE_NOT_FOUND_DESC" = "Se ha producido un error desconocido al comunicar con el dispositivo. Compruebe que el dispositivo está conectado a la alimentación y encendido.";

"COMPUTER_NAME_INFO_TITLE" = "El campo “Nombre de ordenador” se utiliza para indicar el nombre del ordenador que se mostrará en el dispositivo HP."; //title for the Computer name info sheet
"COMPUTER_NAME_INFO_DESC" = "El número de caracteres que puede especificar depende del dispositivo.";

"UNKNOWN_ERROR_TITLE" = "Error desconocido";
"UNKNOWN_ERROR_DESC" = "Ha ocurrido un error desconocido al actualizar el dispositivo. Compruebe que el dispositivo está encendido y conectado correctamente.";

"OK" = "OK";
"CANCEL" = "Cancelar";

"MOREINFO_TITLE" = "Más información";

// The following strings are displayed in SSMTaskController nib file

"SSM_TITLE" = "Administrador de accesos directos de escaneado"; // Title
"SSM_SHORT_DESC" = "Utilice los Accesos directos de escaneado para realizar tareas de escaneado comunes mediante los controles del panel frontal del dispositivo HP."; // short description
"YOUR_COMPUTER_NAME" = "Nombre del ordenador:"; // displayed if device is connected through n/w
"CHANGE_BTN_TITLE" = "Cambiar...";
"MORE_INFO_BTN_TITLE" = "Más información...";
"RESTORE_BTN_TITLE" = "Restablecer predefinidos";
"TEST_BTN_TITLE" = "Probar...";
"EDIT_BTN_TITLE" = "Editar...";

// Error Messages
"ERROR_PERMISSION_DENIED" = "No tiene los privilegios de acceso necesarios para la carpeta “%@”. Para ver o cambiar los privilegios de acceso, seleccione un elemento en el Finder y elija Archivo > Obtener información."; // used from HPWFM, no need to get the localized string from customer.

// generic error
"ERROR" = "Error";
"ERROR_UNKNOWN_DESC" = "Se ha producido un error desconocido.";

// Error when workflow not found when user clicks on front panel scan
"ERROR_SHORTCUT_NOT_FOUND_TITLE" = "No se encuentra el aceso directo";
"ERROR_SHORTCUT_NOT_FOUND_DESC" = "No se encuentra el acceso directo %1$@ al dispositivo %2$@. Vuelva a instalar el software.";

// Error displayed when HPScanWorkflow object creation fails for execution of workflow in SEH interface execute method
"ERROR_WORKFLOW_CREATE_FAIL_TITLE" = "Error al crear el flujo de trabajo";
"ERROR_WORKFLOW_CREATE_FAIL_DESC" = "Error desconocido al crear el flujo de trabajo. Inténtelo de nuevo.";

// Error displayed when copyworkflows fails as due to non availability of permission at user device domain folder
"ERROR_CREATING_DIR_TITLE" = "Error al crear el directorio";
"ERROR_CREATING_DIR_DESC" = "Se ha producido un error al crear el directorio %@. Compruebe los privilegios de acceso al directorio principal y vuelva aintentarlo";

// Error displayed when workflow does not exists when user tries to open the same in Automator
"ERROR_OPENING_WORKFLOW_IN_AUTOMATOR_DESC" = "Ha surgido un error al abrir el flujo de trabajo “%@” en Automator. El flujo de trabajo no se encuentra en la ubicación original";

// New additions: 3/1/2010

// Error displayed when scan link ID received from the device is invalid
"ERROR_INVALID_SCAN_LINK_ID_TITLE" = "El acceso directo a escaneado no está disponible";
"ERROR_INVALID_SCAN_LINK_ID_DESC" = "El acceso directo a escaneado seleccionado no puede ejecutarse porque no es reconocido por el software. Seleccione otro acceso directo a escaneado e inténtelo de nuevo.";

// Tool tips for change, edit and test button
"TIP_FOR_CHANGE_BTN" = "Haga clic para cambiar el nombre del ordenador";
"TIP_FOR_EDIT_BTN" = "Editar la tarea seleccionada";
"TIP_FOR_TEST_BTN" = "Ejecutar la tarea seleccionada";

// New additions: 3/1/2010

// Opt-in/Opt-out strings
"COMPUTER_NAME_TITLE" = "Su nombre de ordenador es";
"COMPUTER_NAME_DESCRIPTION" = "Cuando inicia un escaneado desde su dispositivo HP puede que se le solicite seleccionar su ordenador de una lista de ordenadores de host habilitados para Escanear a ordenador.";
"COMPUTER" = "Ordenador";
"COMPUTERS" = "Ordenadores";

"COMMUNICATION_ERROR" = "No se puede establecer la comunicación del escáner. Asegúrese de que su dispositivo está encendido, compruebe la conexión y asegúrese de que su red funciona correctamente. Tenga en cuenta que Bonjour tiene que estar habilitado en el dispositivo.";
"INSTALLATION_ERROR" = "El software de HP requerido para escanear al equipo no se pudo localizar en este equipo. Descargue e instale el último software recomendado de HP para su dispositivo de http://www.hp.com/support, y vuelva a intentarlo.";

"SCAN_TO_COMPUTER_CANNOT_BE_ENABLED" = "Escanear a ordenador no puede ser habilitado";
"SCAN_TO_COMPUTER_DESCRIPTION" = "Escanear a ordenador le permite iniciar escaneados en el panel delantero de su dispositivo HP y enviar el resultado a su ordenador automáticamente.";

HSDScanActionNotFoundTitle = "No se puede ubicar la acción de escaneo";
HSDScanActionNotFoundDescription = "La acción de escaneado no está registrada. Inicie la aplicación HP Scan ubicada en '%@' para registrar automáticamente esta acción.";
